app/controllers/preorder_controller.rb

  def prefill
    @user  = User.find_or_create_by_email!(params[:email])

    if Settings.use_payment_options
      payment_option_id = params['payment_option']
      raise Exception.new("No payment option was selected") if payment_option_id.nil?
      payment_option = PaymentOption.find(payment_option_id)
---
INSERT INTO "users" ("created_at", "email", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 09 Mar 2013 17:44:20 PST -08:00], ["email", "dennizk@gmail.com"], ["updated_at", Sat, 09 Mar 2013 17:44:20 PST -08:00]]
SELECT "users".* FROM "users" WHERE "users"."email" = 'dennizk@gmail.com' LIMIT 1
SELECT "payment_options".* FROM "payment_options" WHERE "payment_options"."id" = ? LIMIT 1  [["id", "1"]]